# **Test the Kaggle API**

In [1]:
from kaggle.api.kaggle_api_extended import KaggleApi

api = KaggleApi()
api.authenticate()

# List datasets
datasets = api.dataset_list()
for dataset in datasets:
    print(dataset)

shreyanshverma27/online-sales-dataset-popular-marketplace-data
nuhmanpk/india-lok-sabha-election-results-2024
devarajv88/walmart-sales-dataset
dewangmoghe/mobile-phone-price-prediction
mayankanand2701/apple-stock-price-dataset
mayankanand2701/microsoft-stock-price-dataset
ayushparwal2026/country-population-from-1960-to-2022
sahirmaharajj/school-program-attendance
sahirmaharajj/school-tution-dataset
khushikhushikhushi/global-cities-by-gdp
jainaru/thyroid-disease-data
zeesolver/spotfy
kanchana1990/vehicle-dataset-2024
dem0nking/league-of-legends-champions-dataset
saurabhbadole/restaurant-tips-dataset
emirhanai/social-media-usage-and-emotional-well-being
etiennekaiser/gold-silver-platinum-prices-1969-now-usd-gbp-eur
rabailanees/adult-income-dataset
rohit265/credit-card-eligibility-data-determining-factors
hibrahimag1/top-1000-twitch-streamers-data-may-2024

# **Download the Dataset**

In [2]:
import os
from kaggle.api.kaggle_api_extended import KaggleApi

api = KaggleApi()
api.authenticate()

# Specify the dataset
dataset = 'rohit265/credit-card-eligibility-data-determining-factors'  # Replace with actual dataset identifier

# Download the dataset
api.dataset_download_files(dataset, path='/home/kashif/Desktop/ETL_project', unzip=True)

Dataset URL: https://www.kaggle.com/datasets/rohit265/credit-card-eligibility-data-determining-factors

# **Load the Data into a pandas DataFrame**

In [3]:
import pandas as pd

file_path = '/home/kashif/Desktop/ETL_project/dataset.csv'  # Replace with the actual file path
df = pd.read_csv(file_path)

print(df.head())  # Display the first few rows of the dataframe

        ID  Gender  Own_car  Own_property  Work_phone  Phone  Email  \
0  5008804       1        1             1           1      0      0
1  5008806       1        1             1           0      0      0
2  5008808       0        0             1           0      1      1
3  5008812       0        0             1           0      0      0
4  5008815       1        1             1           1      1      1

   Unemployed  Num_children  Num_family  Account_length  Total_income  \
0           0             0           2              15      427500.0
1           0             0           2              29      112500.0
2           0             0           1               4      270000.0
3           1             0           1              20      283500.0
4           0             0           2               5      270000.0

         Age  Years_employed           Income_type  \
0  32.868574       12.435574               Working
1  58.793815        3.104787               Working
2  52.321403        8.353354  Commercial associate
3  61.504343        0.000000             Pensioner
4  46.193967        2.105450               Working

                  Education_type         Family_status       Housing_type  \
0               Higher education        Civil marriage   Rented apartment
1  Secondary / secondary special               Married  House / apartment
2  Secondary / secondary special  Single / not married  House / apartment
3               Higher education             Separated  House / apartment
4               Higher education               Married  House / apartment

  Occupation_type  Target
0           Other       1
1  Security staff       0
2     Sales staff       0
3           Other       0
4     Accountants       0

In [7]:
df.head()

,ID,Gender,Own_car,Own_property,Work_phone,Phone,Email,Unemployed,Num_children,Num_family,Account_length,Total_income,Age,Years_employed,Income_type,Education_type,Family_status,Housing_type,Occupation_type,Target
0,5008804,1,1,1,1,0,0,0,0,2,15,427500.0,32.868574,12.435574,Working,Higher education,Civil marriage,Rented apartment,Other,1
1,5008806,1,1,1,0,0,0,0,0,2,29,112500.0,58.793815,3.104787,Working,Secondary / secondary special,Married,House / apartment,Security staff,0
2,5008808,0,0,1,0,1,1,0,0,1,4,270000.0,52.321403,8.353354,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,Sales staff,0
3,5008812,0,0,1,0,0,0,1,0,1,20,283500.0,61.504343,0.000000,Pensioner,Higher education,Separated,House / apartment,Other,0
4,5008815,1,1,1,1,1,1,0,0,2,5,270000.0,46.193967,2.105450,Working,Higher education,Married,House / apartment,Accountants,0

## *Data Cleaning and Transformation*

In [4]:
df.info()  # Get a concise summary of the DataFrame
df.isnull().sum()  # Check for missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9709 entries, 0 to 9708
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               9709 non-null   int64
 1   Gender           9709 non-null   int64
 2   Own_car          9709 non-null   int64
 3   Own_property     9709 non-null   int64
 4   Work_phone       9709 non-null   int64
 5   Phone            9709 non-null   int64
 6   Email            9709 non-null   int64
 7   Unemployed       9709 non-null   int64
 8   Num_children     9709 non-null   int64
 9   Num_family       9709 non-null   int64
 10  Account_length   9709 non-null   int64
 11  Total_income     9709 non-null   float64
 12  Age              9709 non-null   float64
 13  Years_employed   9709 non-null   float64
 14  Income_type      9709 non-null   object
 15  Education_type   9709 non-null   object
 16  Family_status    9709 non-null   object
 17  Housing_type     9709 non-null   object
 18  Occupation_type  9709 non-null   object
 19  Target           9709 non-null   int64
dtypes: float64(3), int64(12), object(5)
memory usage: 1.5+ MB

ID                 0
Gender             0
Own_car            0
Own_property       0
Work_phone         0
Phone              0
Email              0
Unemployed         0
Num_children       0
Num_family         0
Account_length     0
Total_income       0
Age                0
Years_employed     0
Income_type        0
Education_type     0
Family_status      0
Housing_type       0
Occupation_type    0
Target             0
dtype: int64

## **Removing Duplicates**

In [6]:
df.drop_duplicates(inplace=True)

## **DataFrame into a PostgreSQL table**

In [8]:
from sqlalchemy import create_engine

# Connect to your PostgreSQL database
engine = create_engine('postgresql+psycopg2://postgres:123456@localhost:5432/test')

# Insert data into a table named 'individuals'
df.to_sql('test', engine, if_exists='replace', index=False)

709

## **Query**

In [9]:
import psycopg2

# Connect to your PostgreSQL database
conn = psycopg2.connect(
    dbname="test",
    user="postgres",
    password="123456",
    host="localhost",
    port="5432"
)

# Create a cursor
cursor = conn.cursor()

# Execute a query to count the number of records in the table
cursor.execute("SELECT COUNT(*) FROM test")

# Fetch the result
count = cursor.fetchone()[0]

# Print the count
print("Number of records inserted:", count)

# Close the cursor and connection
cursor.close()
conn.close()

Number of records inserted: 9709

In [11]:
import psycopg2

# Connect to your PostgreSQL database
conn = psycopg2.connect(
    dbname="test",
    user="postgres",
    password="123456",
    host="localhost",
    port="5432"
)

# Create a cursor
cursor = conn.cursor()

# Define the number of rows you want to fetch
num_rows = 20  # You can adjust this number as needed

# Execute a SELECT query to fetch rows from the 'individuals' table
cursor.execute("SELECT * FROM test LIMIT %s", (num_rows,))

# Fetch the column names from the cursor description
col_names = [desc[0] for desc in cursor.description]

# Fetch the rows
rows = cursor.fetchall()

# Print the column headers
print(col_names)

# Print the rows
for row in rows:
    print(row)

# Close the cursor and connection
cursor.close()
conn.close()

['ID', 'Gender', 'Own_car', 'Own_property', 'Work_phone', 'Phone', 'Email', 'Unemployed', 'Num_children', 'Num_family', 'Account_length', 'Total_income', 'Age', 'Years_employed', 'Income_type', 'Education_type', 'Family_status', 'Housing_type', 'Occupation_type', 'Target']
(5008804, 1, 1, 1, 1, 0, 0, 0, 0, 2, 15, 427500.0, 32.86857361889703, 12.4355736257418, 'Working', 'Higher education', 'Civil marriage', 'Rented apartment', 'Other', 1)
(5008806, 1, 1, 1, 0, 0, 0, 0, 0, 2, 29, 112500.0, 58.79381506807121, 3.104786545924968, 'Working', 'Secondary / secondary special', 'Married', 'House / apartment', 'Security staff', 0)
(5008808, 0, 0, 1, 0, 1, 1, 0, 0, 1, 4, 270000.0, 52.32140290355038, 8.353354278321937, 'Commercial associate', 'Secondary / secondary special', 'Single / not married', 'House / apartment', 'Sales staff', 0)
(5008812, 0, 0, 1, 0, 0, 0, 1, 0, 1, 20, 283500.0, 61.50434300498984, 0.0, 'Pensioner', 'Higher education', 'Separated', 'House / apartment', 'Other', 0)
(5008815, 1, 1, 1, 1, 1, 1, 0, 0, 2, 5, 270000.0, 46.1939670219101, 2.1054504883741623, 'Working', 'Higher education', 'Married', 'House / apartment', 'Accountants', 0)
(5008819, 1, 1, 1, 0, 0, 0, 0, 0, 2, 17, 135000.0, 48.67451077024169, 3.269060966344278, 'Commercial associate', 'Secondary / secondary special', 'Married', 'House / apartment', 'Laborers', 0)
(5008825, 0, 1, 0, 0, 0, 0, 0, 0, 2, 25, 130500.0, 29.210729857560388, 3.019911428708324, 'Working', 'Incomplete higher', 'Married', 'House / apartment', 'Accountants', 1)
(5008830, 0, 0, 1, 0, 1, 0, 0, 0, 2, 31, 157500.0, 27.46394518710172, 4.021985393266117, 'Working', 'Secondary / secondary special', 'Married', 'House / apartment', 'Laborers', 1)
(5008834, 0, 0, 1, 0, 0, 0, 0, 1, 2, 44, 112500.0, 30.02936405264995, 4.435409351321383, 'Working', 'Secondary / secondary special', 'Single / not married', 'House / apartment', 'Other', 0)
(5008836, 1, 1, 1, 0, 0, 0, 0, 3, 5, 24, 270000.0, 34.74130201167717, 3.1841858491276342, 'Working', 'Secondary / secondary special', 'Married', 'House / apartment', 'Laborers', 0)
(5008838, 1, 0, 1, 0, 0, 0, 0, 1, 3, 39, 405000.0, 32.42229477675791, 5.519620526088831, 'Commercial associate', 'Higher education', 'Married', 'House / apartment', 'Managers', 0)
(5008844, 1, 1, 1, 0, 1, 0, 0, 0, 2, 43, 112500.0, 56.13256945727839, 12.183686181098858, 'Commercial associate', 'Secondary / secondary special', 'Married', 'House / apartment', 'Drivers', 0)
(5008854, 0, 1, 1, 0, 0, 0, 0, 2, 4, 39, 135000.0, 43.15215233714587, 8.687378933174534, 'Working', 'Secondary / secondary special', 'Married', 'House / apartment', 'Laborers', 0)
(5008868, 0, 0, 1, 0, 0, 0, 0, 1, 3, 24, 211500.0, 44.38694839729769, 19.436401842611414, 'State servant', 'Secondary / secondary special', 'Civil marriage', 'House / apartment', 'Core staff', 0)
(5008872, 1, 1, 1, 0, 1, 0, 0, 0, 2, 10, 360000.0, 45.64090980649842, 14.686133185486357, 'Commercial associate', 'Secondary / secondary special', 'Married', 'House / apartment', 'Security staff', 1)
(5008873, 0, 0, 1, 0, 0, 1, 0, 2, 4, 21, 126000.0, 33.98016386373437, 4.854309123390624, 'Commercial associate', 'Higher education', 'Married', 'House / apartment', 'Managers', 0)
(5008884, 0, 0, 1, 0, 0, 0, 1, 0, 1, 40, 315000.0, 55.26739084307001, 0.0, 'Pensioner', 'Secondary / secondary special', 'Widow', 'House / apartment', 'Other', 0)
(5008888, 0, 0, 1, 0, 0, 0, 0, 0, 1, 11, 247500.0, 46.58822563091645, 3.68796073841352, 'Commercial associate', 'Higher education', 'Separated', 'Rented apartment', 'Core staff', 0)
(5008891, 0, 0, 1, 0, 0, 0, 0, 0, 1, 7, 297000.0, 42.48957884145465, 8.854391260600833, 'Commercial associate', 'Secondary / secondary special', 'Single / not married', 'Rented apartment', 'Laborers', 0)
(5008942, 0, 0, 0, 0, 1, 0, 0, 0, 2, 43, 157500.0, 37.35052738933722, 13.267897355866308, 'Commercial associate', 'Higher education', 'Married', 'House / apartment', 'High skill tech staff', 1)